{
  "suffix_to_id": {
    "reflexive_is": 0,
    "reflexive_ik": 1,
    "active_t": 2,
    "active_tir": 3,
    "active_ir": 4,
    "passive_il": 5,
    "passive_in": 6,
    "negative_me": 7,
    "dative_archaic_ke": 8,
    "locative_den": 9,
    "dative_e": 10,
    "ablative_de": 11,
    "plural_ler": 12,
    "counting_er": 13,
    "cooperative_daş": 14,
    "relative_ce": 15,
    "relative_sel": 16,
    "dimunitive_ek_archaic": 17,
    "approximative_imtrak": 18,
    "accusative": 19,
    "pluralizer_archaic_iz": 20,
    "genitive_im": 21,
    "genitive_in": 22,
    "dimunitive_cik": 23,
    "actor_ci": 24,
    "ordinal_inci": 25,
    "approximative_si": 26,
    "privative_siz": 27,
    "philicative_cil": 28,
    "composessive_li": 29,
    "suitative_lik": 30,
    "adjectiative_ay": 64,
    "marking_ki": 32,
    "temporative_leyin": 33,
    "ideologicative_izm": 34,
    "locative_le": 35,
    "absentative_se": 36,
    "verbifier_e": 37,
    "aplicative_le": 38,
    "grantative_let": 39,
    "transformative_les": 40,
    "acquirative_len": 41,
    "verbifier_ik": 42,
    "nounifier_ecek": 43,
    "infinitive_ma": 44,
    "infinitive_mak": 45,
    "factative_en": 46,
    "factative_er": 47,
    "toolative_ek": 48,
    "adverbial_e": 49,
    "constofactative_gen": 50,
    "constofactative_gin": 51,
    "nounifier_iş": 52,
    "perfectative_ik": 53,
    "nounifier_i": 54,
    "nounifier_gi": 55,
    "nounifier_im": 56,
    "nounifier_in": 57,
    "nounifier_inç": 58,
    "nounifier_inti": 59,
    "toolifier_geç": 60,
    "toolifier_eç": 61,
    "neverfactative_mez": 62,
    "pastfactative_miş": 63
  },
  "id_to_suffix": {
    "0": "reflexive_is",
    "1": "reflexive_ik",
    "2": "active_t",
    "3": "active_tir",
    "4": "active_ir",
    "5": "passive_il",
    "6": "passive_in",
    "7": "negative_me",
    "8": "dative_archaic_ke",
    "9": "locative_den",
    "10": "dative_e",
    "11": "ablative_de",
    "12": "plural_ler",
    "13": "counting_er",
    "14": "cooperative_daş",
    "15": "relative_ce",
    "16": "relative_sel",
    "17": "dimunitive_ek_archaic",
    "18": "approximative_imtrak",
    "19": "accusative",
    "20": "pluralizer_archaic_iz",
    "21": "genitive_im",
    "22": "genitive_in",
    "23": "dimunitive_cik",
    "24": "actor_ci",
    "25": "ordinal_inci",
    "26": "approximative_si",
    "27": "privative_siz",
    "28": "philicative_cil",
    "29": "composessive_li",
    "30": "suitative_lik",
    "31": "adjectiative_ay",
    "32": "marking_ki",
    "33": "temporative_leyin",
    "34": "ideologicative_izm",
    "35": "locative_le",
    "36": "absentative_se",
    "37": "verbifier_e",
    "38": "aplicative_le",
    "39": "grantative_let",
    "40": "transformative_les",
    "41": "acquirative_len",
    "42": "verbifier_ik",
    "43": "nounifier_ecek",
    "44": "infinitive_ma",
    "45": "infinitive_mak",
    "46": "factative_en",
    "47": "factative_er",
    "48": "toolative_ek",
    "49": "adverbial_e",
    "50": "constofactative_gen",
    "51": "constofactative_gin",
    "52": "nounifier_iş",
    "53": "perfectative_ik",
    "54": "nounifier_i",
    "55": "nounifier_gi",
    "56": "nounifier_im",
    "57": "nounifier_in",
    "58": "nounifier_inç",
    "59": "nounifier_inti",
    "60": "toolifier_geç",
    "61": "toolifier_eç",
    "62": "neverfactative_mez",
    "63": "pastfactative_miş",
    "64": "adjectiative_ay"
  },
  "category_to_id": {
    "Noun": 0,
    "Verb": 1
  }
}